package lesson5.homework;

/**
 * Created by Ваня on 16.07.2017.
 *  Тема: Цыклы.
 *  Задача 2: Написать программу с помощью цыкла while, которая выводит цыфры от 10 до 2.
 */
public class LoopsTask2 {
    public static void main(String[] args) {
        int a = 10;
        while(a >= 2){
            System.out.println(a);
            a--;
        }
    }
}
